# 1. Pandas란?
## pandas 사용하기

In [225]:

import numpy as np 
import pandas as pd 

pd.__version__

'1.0.1'

# 2.Pandas 자료구조
## "Series"와 "Data Frame" 
## 2-1 Series

In [226]:
import numpy as np 
import pandas as pd 

# Series 정의

obj = pd.Series([4,7,-5,3])
print(obj)

#값, 인덱스, 타입 확인
print(obj.values)
print(obj.index)
print(obj.dtypes)

obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])
print(obj2)

#dictionay -> Series data
#key -> idx
#value -> value

sdata = {'Kim':35000, "Daehan":67000, 'Taewoo':12000,'Donghyun':4000}
obj3 = pd.Series(sdata)
print(obj3)

obj3.index = ['A','B','C','D']
print(obj3)

0    4
1    7
2   -5
3    3
dtype: int64
[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)
int64
d    4
b    7
a   -5
c    3
dtype: int64
Kim         35000
Daehan      67000
Taewoo      12000
Donghyun     4000
dtype: int64
A    35000
B    67000
C    12000
D     4000
dtype: int64

## 2.2 Data Frame

In [227]:
import pandas as pd
import numpy as np


data = {'name':['Daehan','Taewoo','Donghyun','Kim','Smallstone'],'year':[2013,2014,2015,2016,2017],'points':[1.5,1.7,3.6,2.4,2.9]}
df = pd.DataFrame(data)
print(df)
print("\n")
print("df.index:",df.index)
print("df.colums:",df.columns)
print("df.values:\n",df.values)
print("\n")
# 이름 설정
df.index.name='Num'
df.columns.name="Info"
print(df)
print("\n")
#DataFrame에 columms, index 설정 

df2 = pd.DataFrame(data,columns=['year','name','points','penalty'],index=['one','two','three','four','five'])
print(df2)
print("\n")

name  year  points
0      Daehan  2013     1.5
1      Taewoo  2014     1.7
2    Donghyun  2015     3.6
3         Kim  2016     2.4
4  Smallstone  2017     2.9


df.index: RangeIndex(start=0, stop=5, step=1)
df.colums: Index(['name', 'year', 'points'], dtype='object')
df.values:
 [['Daehan' 2013 1.5]
 ['Taewoo' 2014 1.7]
 ['Donghyun' 2015 3.6]
 ['Kim' 2016 2.4]
 ['Smallstone' 2017 2.9]]


Info        name  year  points
Num
0         Daehan  2013     1.5
1         Taewoo  2014     1.7
2       Donghyun  2015     3.6
3            Kim  2016     2.4
4     Smallstone  2017     2.9


       year        name  points penalty
one    2013      Daehan     1.5     NaN
two    2014      Taewoo     1.7     NaN
three  2015    Donghyun     3.6     NaN
four   2016         Kim     2.4     NaN
five   2017  Smallstone     2.9     NaN

### DataFrame에 딕셔너리 값 입력시
### 딕셔너리와 columms의 순서가 달라도 알아서 정의됨
### 값이 없으면 NaN

In [228]:
# describe() 함수는 DataFrame의 계산 가능한 값들에 대한 다양한 계산 보여줌
df2.describe()

              year    points
count     5.000000  5.000000
mean   2015.000000  2.420000
std       1.581139  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2016.000000  2.900000
max    2017.000000  3.600000

# 3. DataFrame Indexing

In [229]:
import pandas as pd 
import numpy as np 

data = {'names':['Daehan','Kim','Taewoo','Donghyun','Smallstone'],'year':[2014,2015,2016,2015,2017],'points':[1.5,1.7,3.6,2.4,2.9]}
df = pd.DataFrame(data,columns=['year','names','points','penalty'],index=['one','two','three','four','five'])
df

       year       names  points penalty
one    2014      Daehan     1.5     NaN
two    2015         Kim     1.7     NaN
three  2016      Taewoo     3.6     NaN
four   2015    Donghyun     2.4     NaN
five   2017  Smallstone     2.9     NaN

In [230]:
df['year']

one      2014
two      2015
three    2016
four     2015
five     2017
Name: year, dtype: int64

In [231]:
df.year

one      2014
two      2015
three    2016
four     2015
five     2017
Name: year, dtype: int64

In [232]:
df[['year','points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2017     2.9

In [233]:
df.penalty=0.5
df

       year       names  points  penalty
one    2014      Daehan     1.5      0.5
two    2015         Kim     1.7      0.5
three  2016      Taewoo     3.6      0.5
four   2015    Donghyun     2.4      0.5
five   2017  Smallstone     2.9      0.5

In [234]:
df.penalty=[0.1,0.2,0.3,0.4,0.5]
df

       year       names  points  penalty
one    2014      Daehan     1.5      0.1
two    2015         Kim     1.7      0.2
three  2016      Taewoo     3.6      0.3
four   2015    Donghyun     2.4      0.4
five   2017  Smallstone     2.9      0.5

In [235]:
df['zeros'] = np.arange(5)
df

       year       names  points  penalty  zeros
one    2014      Daehan     1.5      0.1      0
two    2015         Kim     1.7      0.2      1
three  2016      Taewoo     3.6      0.3      2
four   2015    Donghyun     2.4      0.4      3
five   2017  Smallstone     2.9      0.5      4

In [236]:
#원하는 index에 Series 추가
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
df['debt'] = val
df

       year       names  points  penalty  zeros  debt
one    2014      Daehan     1.5      0.1      0   NaN
two    2015         Kim     1.7      0.2      1  -1.2
three  2016      Taewoo     3.6      0.3      2   NaN
four   2015    Donghyun     2.4      0.4      3  -1.5
five   2017  Smallstone     2.9      0.5      4  -1.7

In [237]:
df['net_points'] = df['points']-df['penalty']
df['high_points'] = df['net_points']>2.0
df

       year       names  points  penalty  zeros  debt  net_points  high_points
one    2014      Daehan     1.5      0.1      0   NaN         1.4        False
two    2015         Kim     1.7      0.2      1  -1.2         1.5        False
three  2016      Taewoo     3.6      0.3      2   NaN         3.3         True
four   2015    Donghyun     2.4      0.4      3  -1.5         2.0        False
five   2017  Smallstone     2.9      0.5      4  -1.7         2.4         True

In [238]:
# 열 삭제 
del df['high_points']
del df['net_points']
del df['zeros']
df

       year       names  points  penalty  debt
one    2014      Daehan     1.5      0.1   NaN
two    2015         Kim     1.7      0.2  -1.2
three  2016      Taewoo     3.6      0.3   NaN
four   2015    Donghyun     2.4      0.4  -1.5
five   2017  Smallstone     2.9      0.5  -1.7

## 3.2 DataFrame에서 행을 선택하고 변경

In [239]:
#슬라이싱
df[0:3]

       year   names  points  penalty  debt
one    2014  Daehan     1.5      0.1   NaN
two    2015     Kim     1.7      0.2  -1.2
three  2016  Taewoo     3.6      0.3   NaN

In [240]:
# loc로 행 값 가져오기 
df.loc['two']

year       2015
names       Kim
points      1.7
penalty     0.2
debt       -1.2
Name: two, dtype: object

In [241]:
# two부터 four까지 출력
df.loc['two':'four']

       year     names  points  penalty  debt
two    2015       Kim     1.7      0.2  -1.2
three  2016    Taewoo     3.6      0.3   NaN
four   2015  Donghyun     2.4      0.4  -1.5

In [242]:
# Dataframe 행, points 출력
df.loc['two':'four','points']

two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [243]:
df.loc[:,'year']

one      2014
two      2015
three    2016
four     2015
five     2017
Name: year, dtype: int64

In [244]:
df.loc[:,['year','names']]

       year       names
one    2014      Daehan
two    2015         Kim
three  2016      Taewoo
four   2015    Donghyun
five   2017  Smallstone

In [245]:
df.loc['six',:]=[2013,'Kim',4.0,0.1,2.1]
df

         year       names  points  penalty  debt
one    2014.0      Daehan     1.5      0.1   NaN
two    2015.0         Kim     1.7      0.2  -1.2
three  2016.0      Taewoo     3.6      0.3   NaN
four   2015.0    Donghyun     2.4      0.4  -1.5
five   2017.0  Smallstone     2.9      0.5  -1.7
six    2013.0         Kim     4.0      0.1   2.1

In [246]:
#3번째 행
df.iloc[3]

year           2015
names      Donghyun
points          2.4
penalty         0.4
debt           -1.5
Name: four, dtype: object

In [247]:
df.iloc[3:5,0:2]

        year       names
four  2015.0    Donghyun
five  2017.0  Smallstone

## 4. DataFrame에서 boolean Indexing

In [248]:
df

         year       names  points  penalty  debt
one    2014.0      Daehan     1.5      0.1   NaN
two    2015.0         Kim     1.7      0.2  -1.2
three  2016.0      Taewoo     3.6      0.3   NaN
four   2015.0    Donghyun     2.4      0.4  -1.5
five   2017.0  Smallstone     2.9      0.5  -1.7
six    2013.0         Kim     4.0      0.1   2.1

In [249]:
df['year']>2014

one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [250]:
# 2014 넘는 값만 출력
df.loc[df['year']>2014,:]

         year       names  points  penalty  debt
two    2015.0         Kim     1.7      0.2  -1.2
three  2016.0      Taewoo     3.6      0.3   NaN
four   2015.0    Donghyun     2.4      0.4  -1.5
five   2017.0  Smallstone     2.9      0.5  -1.7

In [251]:
df.loc[df['names']=='Kim',['names','points']]

    names  points
two   Kim     1.7
six   Kim     4.0

In [252]:
# 조건삽입
df.loc[(df['points']>2)&(df['points']<3),:]

        year       names  points  penalty  debt
four  2015.0    Donghyun     2.4      0.4  -1.5
five  2017.0  Smallstone     2.9      0.5  -1.7

## 5.Data

In [253]:
# DataFrame을 random 으로 생성
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0 -1.322804  0.492548 -2.569857  0.217364
1  0.028957 -0.584673  0.589235  0.302366
2 -0.776697  0.419195  1.465853  0.158839
3 -1.366887 -1.174615 -0.465372  0.281942
4 -0.105503  1.729760  0.825990  0.290706
5 -0.219454 -0.593900 -0.143883 -1.209758

In [254]:
# columms, index 설정
df.columns=['A','B','C','D']
df.index = pd.date_range('20160701',periods=6)
df

                   A         B         C         D
2016-07-01 -1.322804  0.492548 -2.569857  0.217364
2016-07-02  0.028957 -0.584673  0.589235  0.302366
2016-07-03 -0.776697  0.419195  1.465853  0.158839
2016-07-04 -1.366887 -1.174615 -0.465372  0.281942
2016-07-05 -0.105503  1.729760  0.825990  0.290706
2016-07-06 -0.219454 -0.593900 -0.143883 -1.209758

In [255]:
df['F'] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0]
df

                   A         B         C         D    F
2016-07-01 -1.322804  0.492548 -2.569857  0.217364  1.0
2016-07-02  0.028957 -0.584673  0.589235  0.302366  NaN
2016-07-03 -0.776697  0.419195  1.465853  0.158839  3.5
2016-07-04 -1.366887 -1.174615 -0.465372  0.281942  6.1
2016-07-05 -0.105503  1.729760  0.825990  0.290706  NaN
2016-07-06 -0.219454 -0.593900 -0.143883 -1.209758  7.0

In [256]:
#행의 값중 하나라도 nan인 경우 그 행을 없앤다.
df.dropna(how='any')

                   A         B         C         D    F
2016-07-01 -1.322804  0.492548 -2.569857  0.217364  1.0
2016-07-03 -0.776697  0.419195  1.465853  0.158839  3.5
2016-07-04 -1.366887 -1.174615 -0.465372  0.281942  6.1
2016-07-06 -0.219454 -0.593900 -0.143883 -1.209758  7.0

In [257]:
#다시 복귀
df.dropna(how='all')

                   A         B         C         D    F
2016-07-01 -1.322804  0.492548 -2.569857  0.217364  1.0
2016-07-02  0.028957 -0.584673  0.589235  0.302366  NaN
2016-07-03 -0.776697  0.419195  1.465853  0.158839  3.5
2016-07-04 -1.366887 -1.174615 -0.465372  0.281942  6.1
2016-07-05 -0.105503  1.729760  0.825990  0.290706  NaN
2016-07-06 -0.219454 -0.593900 -0.143883 -1.209758  7.0

In [258]:
# nan값에 값 넣기
df.fillna(value=0.5)

                   A         B         C         D    F
2016-07-01 -1.322804  0.492548 -2.569857  0.217364  1.0
2016-07-02  0.028957 -0.584673  0.589235  0.302366  0.5
2016-07-03 -0.776697  0.419195  1.465853  0.158839  3.5
2016-07-04 -1.366887 -1.174615 -0.465372  0.281942  6.1
2016-07-05 -0.105503  1.729760  0.825990  0.290706  0.5
2016-07-06 -0.219454 -0.593900 -0.143883 -1.209758  7.0

In [259]:
# 전체 값에 nan 값이 있는지 확인
df.isnull()

                A      B      C      D      F
2016-07-01  False  False  False  False  False
2016-07-02  False  False  False  False   True
2016-07-03  False  False  False  False  False
2016-07-04  False  False  False  False  False
2016-07-05  False  False  False  False   True
2016-07-06  False  False  False  False  False

In [260]:
# nan이 있는 모든 F열에 행 추출
df.loc[df.isnull()['F'],:]

                   A         B         C         D   F
2016-07-02  0.028957 -0.584673  0.589235  0.302366 NaN
2016-07-05 -0.105503  1.729760  0.825990  0.290706 NaN

In [261]:
pd.to_datetime('20160701')

Timestamp('2016-07-01 00:00:00')

In [262]:
# 특정 행 drop
df.drop(pd.to_datetime('20160701'))

                   A         B         C         D    F
2016-07-02  0.028957 -0.584673  0.589235  0.302366  NaN
2016-07-03 -0.776697  0.419195  1.465853  0.158839  3.5
2016-07-04 -1.366887 -1.174615 -0.465372  0.281942  6.1
2016-07-05 -0.105503  1.729760  0.825990  0.290706  NaN
2016-07-06 -0.219454 -0.593900 -0.143883 -1.209758  7.0

In [263]:
#2개도 가능
df.drop([pd.to_datetime('20160701'),pd.to_datetime('20160704')])

                   A         B         C         D    F
2016-07-02  0.028957 -0.584673  0.589235  0.302366  NaN
2016-07-03 -0.776697  0.419195  1.465853  0.158839  3.5
2016-07-05 -0.105503  1.729760  0.825990  0.290706  NaN
2016-07-06 -0.219454 -0.593900 -0.143883 -1.209758  7.0

In [264]:
# 열 삭제 
df.drop('F',axis=1)

                   A         B         C         D
2016-07-01 -1.322804  0.492548 -2.569857  0.217364
2016-07-02  0.028957 -0.584673  0.589235  0.302366
2016-07-03 -0.776697  0.419195  1.465853  0.158839
2016-07-04 -1.366887 -1.174615 -0.465372  0.281942
2016-07-05 -0.105503  1.729760  0.825990  0.290706
2016-07-06 -0.219454 -0.593900 -0.143883 -1.209758

In [265]:
#2개도 가능
df.drop(['B','D'],axis=1)

                   A         C    F
2016-07-01 -1.322804 -2.569857  1.0
2016-07-02  0.028957  0.589235  NaN
2016-07-03 -0.776697  1.465853  3.5
2016-07-04 -1.366887 -0.465372  6.1
2016-07-05 -0.105503  0.825990  NaN
2016-07-06 -0.219454 -0.143883  7.0

## 6. Data 분석용 함수들

In [266]:
data = [[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]]
df = pd.DataFrame(data, columns=["one","two"],index=["a","b","c","d"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [267]:
print(df.sum(axis=0))
print('\n')
print(df.sum(axis=1))

one    9.25
two   -5.80
dtype: float64


a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [268]:
# Nan 고려 skipna 옵션
df.sum(axis=1,skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [269]:
# 특정 행 또 특정 열에서만 계산하기 
df['one'].sum()

9.25

In [270]:
df.loc['b'].sum()

2.5999999999999996



## pandas에서 DataFrame에 적용되는 함수들

### count 전체 성분의 (NaN이 아닌) 값의 갯수를 계산

### min, max 전체 성분의 최솟, 최댓값을 계산

### argmin, argmax 전체 성분의 최솟값, 최댓값이 위치한 (정수)인덱스를 반환

### idxmin, idxmax 전체 인덱스 중 최솟값, 최댓값을 반환

### quantile 전체 성분의 특정 사분위수에 해당하는 값을 반환 (0~1 사이)

### sum 전체 성분의 합을 계산

### mean 전체 성분의 평균을 계산

### median 전체 성분의 중간값을 반환

### mad 전체 성분의 평균값으로부터의 절대 편차(absolute deviation)의 평균을 계산

### std, var 전체 성분의 표준편차, 분산을 계산

### cumsum 맨 첫 번째 성분부터 각 성분까지의 누적합을 계산 (0에서부터 계속 더해짐)

### cumprod 맨 첫번째 성분부터 각 성분까지의 누적곱을 계산 (1에서부터 계속 곱해짐)

In [271]:

df = pd.DataFrame(np.random.randn(6,4),columns=['A','B','C','D'], index = pd.date_range('20200301',periods=6))
df

                   A         B         C         D
2020-03-01  1.349023 -0.776913 -0.369389  0.235691
2020-03-02 -0.357390 -0.781138  0.022793 -0.022674
2020-03-03 -1.066161  0.224158  0.022882  0.402264
2020-03-04 -0.571692  0.638446 -1.569304  0.826422
2020-03-05  1.123008  1.263393  1.751469 -0.813192
2020-03-06  0.068768 -0.950413 -2.307296  1.398501

In [272]:
#상관계수 구하기
df['A'].corr(df['B'])

0.003500163597302889

In [273]:
# 공분산 
df['B'].cov(df['C'])

0.7043941238134566

### 정렬 함수 및 기타함수

In [274]:


dates = df.index
random_dates = np.random.permutation(dates)
df = df.reindex(index=random_dates, columns=["D", "B", "C", "A"])
df

                   D         B         C         A
2020-03-05 -0.813192  1.263393  1.751469  1.123008
2020-03-02 -0.022674 -0.781138  0.022793 -0.357390
2020-03-04  0.826422  0.638446 -1.569304 -0.571692
2020-03-01  0.235691 -0.776913 -0.369389  1.349023
2020-03-06  1.398501 -0.950413 -2.307296  0.068768
2020-03-03  0.402264  0.224158  0.022882 -1.066161

In [275]:
df.sort_index(axis=0)

                   D         B         C         A
2020-03-01  0.235691 -0.776913 -0.369389  1.349023
2020-03-02 -0.022674 -0.781138  0.022793 -0.357390
2020-03-03  0.402264  0.224158  0.022882 -1.066161
2020-03-04  0.826422  0.638446 -1.569304 -0.571692
2020-03-05 -0.813192  1.263393  1.751469  1.123008
2020-03-06  1.398501 -0.950413 -2.307296  0.068768

In [276]:
df.sort_index(axis=1)

                   A         B         C         D
2020-03-05  1.123008  1.263393  1.751469 -0.813192
2020-03-02 -0.357390 -0.781138  0.022793 -0.022674
2020-03-04 -0.571692  0.638446 -1.569304  0.826422
2020-03-01  1.349023 -0.776913 -0.369389  0.235691
2020-03-06  0.068768 -0.950413 -2.307296  1.398501
2020-03-03 -1.066161  0.224158  0.022882  0.402264

In [277]:
#내림차순
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2020-03-05 -0.813192  1.751469  1.263393  1.123008
2020-03-02 -0.022674  0.022793 -0.781138 -0.357390
2020-03-04  0.826422 -1.569304  0.638446 -0.571692
2020-03-01  0.235691 -0.369389 -0.776913  1.349023
2020-03-06  1.398501 -2.307296 -0.950413  0.068768
2020-03-03  0.402264  0.022882  0.224158 -1.066161

In [278]:
df["E"] = np.random.randint(0, 6, size=6)
df["F"] = ["alpha", "beta", "gamma", "gamma", "alpha", "gamma"]
df

                   D         B         C         A  E      F
2020-03-05 -0.813192  1.263393  1.751469  1.123008  0  alpha
2020-03-02 -0.022674 -0.781138  0.022793 -0.357390  4   beta
2020-03-04  0.826422  0.638446 -1.569304 -0.571692  0  gamma
2020-03-01  0.235691 -0.776913 -0.369389  1.349023  1  gamma
2020-03-06  1.398501 -0.950413 -2.307296  0.068768  3  alpha
2020-03-03  0.402264  0.224158  0.022882 -1.066161  4  gamma

In [279]:
df.sort_values(by=["E","F"])

                   D         B         C         A  E      F
2020-03-05 -0.813192  1.263393  1.751469  1.123008  0  alpha
2020-03-04  0.826422  0.638446 -1.569304 -0.571692  0  gamma
2020-03-01  0.235691 -0.776913 -0.369389  1.349023  1  gamma
2020-03-06  1.398501 -0.950413 -2.307296  0.068768  3  alpha
2020-03-02 -0.022674 -0.781138  0.022793 -0.357390  4   beta
2020-03-03  0.402264  0.224158  0.022882 -1.066161  4  gamma

In [280]:
df["F"].unique()

array(['alpha', 'beta', 'gamma'], dtype=object)

In [281]:
df['F'].value_counts()

gamma    3
alpha    2
beta     1
Name: F, dtype: int64

In [282]:
#값이 있는지 확인
df["F"].isin(['alpha','beta'])

2020-03-05     True
2020-03-02     True
2020-03-04    False
2020-03-01    False
2020-03-06     True
2020-03-03    False
Name: F, dtype: bool

In [283]:
df3 = pd.DataFrame(np.random.randn(4, 3), columns=["b", "d", "e"],
                   index=["Seoul", "Incheon", "Busan", "Daegu"])
df3

                b         d         e
Seoul    1.145737  0.742289  0.262478
Incheon -0.610047  0.817200 -2.937763
Busan    1.236774 -2.011269 -2.192971
Daegu    0.498211  1.624008  1.085422

In [284]:
# 힘수 정의 및 적용
func = lambda x: x.max() - x.min()

In [285]:
df3.apply(func, axis=0)

b    1.846821
d    3.635277
e    4.023186
dtype: float64